Repository: bernardo-marsshot/Navigator
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: Optional: other names this SKU might appear as.
pt: Opcional: outros nomes com que este SKU pode aparecer.

source: CSS selector for current price (e.g., '.price_color')
pt: Seletor CSS para preço atual (ex: '.price_color')

source: CSS selector for promo price if any
pt: Seletor CSS para preço promocional (se existir)

source: CSS selector for promo text/badge
pt: Seletor CSS para texto/etiqueta promocional

source: Optional: raw extracted text for audit/debug
pt: Opcional: texto extraído em bruto para auditoria/debug

source: No active listings found to scrape.
pt: Nenhuma listagem ativa encontrada para extrair.

source: All %(total)s active listings failed to scrape. Failed retailers:
pt: Todas as %(total)s listagens ativas falharam. Retalhistas que falharam:

source: All %(total)s active listings failed to scrape.
pt: Todas as %(total)s listagens ativas falharam.

source: Successfully scraped %(count)s listings!
pt: %(count)s listagens extraídas com sucesso!

source: Scraped %(scraped)s of %(total)s listings. Failed retailers:
pt: Extraídas %(scraped)s de %(total)s listagens. Retalhistas que falharam:

source: Scraped %(scraped)s of %(total)s listings.
pt: Extraídas %(scraped)s de %(total)s listagens.

source: Error during scraping: %(error)s
pt: Erro durante a extração: %(error)s

source: Price Evolution by Retailer
pt: Evolução de Preços por Retalhista

source: No promotion
pt: Sem promoção

source: Navigator Logo
pt: Logótipo Navigator

source: Prototype developed by
pt: Protótipo desenvolvido por

source: SKUs — Latest Prices
pt: SKUs — Últimos Preços

source: Configure
pt: Configurar

source: Scrape Now
pt: Recolher Dados

source: Name
pt: Nome

source: Latest Price
pt: Último Preço

source: Promo
pt: Promoção

source: Currency
pt: Moeda

source: No data
pt: Sem dados

source: View Details
pt: Ver Detalhes

source: Back
pt: Voltar

source: Report
pt: Relatorio

source: Update Data
pt: Atualizar Dados

source: Price
pt: Preço

source: Time
pt: Tempo

source: History
pt: Histórico

source: Date
pt: Data

source: Retailer
pt: Retalhista

source: Note
pt: Nota

source: No promo
pt: Sem promoção

source: Scraped from search
pt: Extraído por pesquisa

source: Auto-extracted
pt: Auto-extraído

source: No debug info
pt: Sem informação
